/** Задача : равнобедренный треугольник
Напишите программу, в которой используется только две инструкции вывода: cout
<< "#" и cout << "\n" для создания узора из символов # в виде равнобедренного
треугольника:
#
##
###
####
###
##
#
*/